[
  {
    "what": "Senior Fullstack Engineer",
    "where": "Parser",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2025-06-23",
      "2025-10-01"
    ],
    "content": [
      "• Developed AI agent that helps the migration and merging of 2 databases.",
      "Designed and developed AI agent that allows the verification of the legality of a process using RAG.",
      "Designed and developed CI pipelines ensuring quality via unit testing and security validation.",
      "Technologies: SQL, Python, LangChain, Docker"
    ]
  },
  {
    "what": "Senior Node.js Developer",
    "where": "Globant",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2024-05-20",
      "2025-06-19"
    ],
    "content": [
      "• Contribute to the development of an event-driven platform leveraging AWS, MongoDB, and Confluent Kafka Cloud, enabling seamless event streaming and improved system scalability.",
      "• Designed and implemented an NPM based event-bus module to standardize event consumption and production across multiple projects, ensuring robust integration, enhanced security and fast updates of all the systems using it.",
      "• Developed role-based access control (RBAC) and authentication mechanisms to secure the event-streaming platform.",
      "• Architected and managed AWS environments using Terraform and AWS CLI.",
      "• Designed and maintained CI/CD pipelines for multiple projects, ensuring rapid, reliable, and automated deployments.",
      "• Maintain a SQL Server database enhancing the security, deployments, migrations and access control.",
      "Technologies: SQL, SQL Server, TypeScript, JavaScript, Node.js, Amazon Web Services (AWS), AWS Lambdas, Terraform, Kafka"
    ]
  },
  {
    "what": "Software Engineer",
    "where": "Cocora.io",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2023-02-01",
      "2023-03-01"
    ],
    "content": [
      "• Create and design the services architecture for the web platform.",
      "• Defining technologies, libraries, third party services and patterns to use on the services.",
      "• Stripe integration.",
      "Technologies: SQL, TypeScript, PostgreSQL, Amazon Web Services (AWS), React.js, JavaScript, CSS, Node.js, JavaScript"
    ]
  },
  {
    "what": "Senior Software Engineer",
    "where": "Bunny Studio",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2022-05-01",
      "2022-12-31"
    ],
    "content": [
      "• Development of Split payment flow, where the user can pay with multiple payment methods to increase the conversion and satisfaction of the clients.",
      "• Serverless function to generate data exports files that clients can use to export their information. Reducing the friction with databases on production and the stability of the system.",
      "• Debugging of payments flow to improve efficiency and security.",
      "• Stripe integration.",
      "Technologies: JavaScript, Node.js, PHP, SQL, CSS, AWS, Docker, Serverless, Stripe, ReactJS, Redux"
    ]
  },
  {
    "what": "Technical Consultant",
    "where": "Apple Travel",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2021-07-01"
    ],
    "content": [
      "• Technical support on office and web development.",
      "Technologies: WordPress, Node.js, CSS, Network"
    ]
  },
  {
    "what": "Senior Developer",
    "where": "Archuleta Group",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2020-01-01",
      "2022-05-01"
    ],
    "content": [
      "• More than 60 sites created for franchises puts the principal client/partner company on the Marketing Top 3 Top franchise suppliers by Entrepreneur.",
      "Technologies: JavaScript, Node.js, PHP, WordPress, CSS"
    ]
  },
  {
    "what": "Web Developer",
    "where": "Advice Local",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2018-03-01",
      "2020-01-01"
    ],
    "content": [
      "• More than 60 individual sites build for locations of a franchise in less than 1 year.",
      "Technologies: JavaScript, PHP, WordPress, Node.js, CSS"
    ]
  },
  {
    "what": "Web Developer",
    "where": "Advice Local",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2017-03-01",
      "2017-08-01"
    ],
    "content": [
      "• More than 120 sites hosted and maintained on the own servers of the company without major interruptions.",
      "Technologies: JavaScript, PHP, WordPress, Node.js, CSS"
    ]
  },
  {
    "what": "Medellín Director",
    "where": "Coderise",
    "place": "Medellín, Colombia",
    "date": [
      "2014-01-01",
      "2019-07-01"
    ],
    "content": [
      "• 3 versions of the program/course graduated.",
      "• More than 60 adolescents learned the basics of web programming."
    ]
  },
  {
    "what": "Co Founder and Technical Lead",
    "where": "Blind Coffee",
    "place": "Medellín, Colombia",
    "date": [
      "2015-08-01",
      "2015-10-01"
    ],
    "content": [
      "• Development of the MCV in less than 1 week.",
      "• More than 150 persons reached and attended to the 6 events hosted on cafes around the city to know new people based on the form fills through the website.",
      "Technologies: Node.js, PostgreSQL, JavaScript, CSS"
    ]
  },
  {
    "what": "Tech Hiring and Recruitment Intern",
    "where": "Socialatom Group",
    "place": "Medellín, Colombia",
    "date": [
      "2015-02-01",
      "2015-07-01"
    ],
    "content": [
      "• Mapping of top developers into the Medellín and Bogota areas to be hired as CTOs on the companies of the portfolio.",
      "• 2 new CTOs hired from that mapping."
    ]
  },
  {
    "what": "Consultant",
    "where": "MortgageHippo",
    "place": "Medellín, Colombia (Remote)",
    "date": [
      "2014-05-01",
      "2014-09-01"
    ],
    "content": [
      "• Creation of the blog part of the site.",
      "Technologies: PHP, WordPress, CSS, JavaScript"
    ]
  },
]